USE cinemas;

INSERT INTO cinemas(name, district, category, capacity, is_opened)
VALUES 
	('Кинотеатр 1', 'Район №9', 'Категория 1', 123, 1), 
	('Кинотеатр 2', 'Район №10', 'Категория 2', 200, 1), 
	('Кинотеатр 3', 'Район №11', 'Категория 3', 123, 0), 
	('Кинотеатр 4', 'Район №12', 'Категория 4', 123, 1);

INSERT INTO actors(name) 
VALUES 
	('Дэниэл Крейг'),
	('Ева Грин'),
	('Том Круз'),
	('Брэд Питт'),
	('Николас Кейдж');

INSERT INTO movies
VALUES 
	('Миссия Невыполнима', 'Продюсер 1', 'Оператор 1', 'Боевик', 'Hollywood', 'Награда 1, Награда 2', 60 * 60 * 3, 'images/screenshot-1.png', 1, 100000),
	('Миссия Невыполнима 2', 'Продюсер 2', 'Оператор 2', 'Комедия', 'Hollywood', 'Награда 3, Награда 4', 60 * 60 * 2.2, 'images/screenshot-2.png', 1, 110000),
	('Миссия Невыполнима 3', 'Продюсер 3', 'Оператор 3', 'Драма', 'Москва', 'Награда 5, Награда 6', 60 * 60 * 2.5, 'images/screenshot-3.png', 1, 120000),
	('Миссия Невыполнима 4', 'Продюсер 4', 'Оператор 4', 'Комедия', 'Hollywood', 'Награда 10, Награда 8', 60 * 60 * 3, 'images/screenshot-4.png', 1, 200000),
	('Миссия Невыполнима 5', 'Продюсер 5', 'Оператор 5', 'Фантастика', 'Hollywood', 'Награда 3, Награда 5', 60 * 60 * 2.8, 'images/screenshot-5.png', 1, 300000);

INSERT INTO actor_movie
VALUES 
	(1, 1, 1),	
	(1, 3, 1),
	(2, 1, 0),
	(2, 2, 1),
	(2, 4, 0),
	(3, 1, 0),
	(3, 2, 0),
	(3, 4, 0),
	(4, 1, 1),
	(4, 5, 1),
	(4, 3, 1),
	(5, 2, 0),
	(5, 5, 0);

INSERT INTO sessions
VALUES 
	(1, 1, 100, 50, '2023-11-17'),
	(1, 3, 200, 60, '2023-11-15'),
	(1, 4, 250, 55, '2023-11-16'),
	(2, 2, 250, 45, '2023-12-11'),
	(2, 5, 350, 11, '2023-12-15'),
	(2, 1, 450, 50, '2023-12-20'),
	(3, 2, 350, 30, '2023-12-24'),
	(3, 5, 250, 20, '2023-11-24'),
	(3, 3, 300, 10, '2023-11-10'),
	(4, 1, 300, 20, '2023-11-10'),
	(4, 1, 300, 20, '2023-11-10');

SELECT * FROM sessions;